#!/bin/bash
#====================================================================
# aptのアップデート
#====================================================================
sudo apt-get update
sudo apt-get upgrade

#====================================================================
# 『デスクトップ』『音楽』などの日本語フォルダー名を英語表記にする
#====================================================================
env LANGUAGE=C LC_MESSAGES=C xdg-user-dirs-gtk-update

#====================================================================
# ソフトウェアインストール
#====================================================================

# 便利ツール
sudo apt-get install curl wget
sudo apt-get install vim
sudo apt-get install virtualbox-guest-dkms

#====================================================================
# Python開発環境構築
#====================================================================
sudo apt-get install python-pip python2.7 python2.7-dev python3
sudo pip install virtualenv
sudo pip install virtualenvwrapper

